; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v9)
             (pred_8 ?v10 ?v12)
             (pred_7 ?v7 ?v12)
             (pred_6 ?v6 ?v7 )
	     (pred_4 ?v7)
             (pred_5 ?v8)
             (pred_9 ?v10)
             (pred_11 ?v12)
             (pred_3 ?v7)
             (pred_1 ?v10)
             (pred_2 ?v7)
             (pred_12 ))



(:action op_4
:parameters (?v5 ?v4 ?v13 ?v3)
:precondition (and (pred_5 ?v5) (pred_5 ?v4) (pred_9 ?v13) (pred_11 ?v3)
          (pred_10 ?v5 ?v4) (pred_8 ?v13 ?v3)
                   (pred_7 ?v4 ?v3) (pred_4 ?v5) 
                   (pred_3 ?v4) (pred_1 ?v13))
:effect (and  (pred_2 ?v4) (not (pred_3 ?v4))))


(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_5 ?v5) (pred_5 ?v1)
               (pred_4 ?v5) (pred_10 ?v5 ?v1) (pred_2 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v5))))

(:action op_1
:parameters (?v5 ?v13)
:precondition (and (pred_5 ?v5) (pred_9 ?v13) 
                  (pred_4 ?v5) (pred_6 ?v13 ?v5) (pred_12 ))
:effect (and (pred_1 ?v13)
   (not (pred_6 ?v13 ?v5)) (not (pred_12 ))))


(:action op_2
:parameters (?v5 ?v11 ?v2)
:precondition (and (pred_5 ?v5) (pred_9 ?v11) (pred_9 ?v2)
                  (pred_4 ?v5) (pred_1 ?v2) (pred_6 ?v11 ?v5))
:effect (and (pred_1 ?v11) (pred_6 ?v2 ?v5)
        (not (pred_1 ?v2)) (not (pred_6 ?v11 ?v5))))

(:action op_3
:parameters (?v5 ?v13)
:precondition (and (pred_5 ?v5) (pred_9 ?v13) 
                  (pred_4 ?v5) (pred_1 ?v13))
:effect (and (pred_12 ) (pred_6 ?v13 ?v5) (not (pred_1 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_13 obj_23 obj_12 obj_27 obj_17 obj_03 obj_01 obj_10 obj_05 obj_20 obj_26 obj_21 obj_19 obj_06 obj_16 obj_31 obj_30 obj_09 obj_18 obj_22 obj_25 obj_29 obj_14 obj_08
    obj_02 obj_24 obj_07
    obj_11 obj_28 obj_15
    )

    (:init
       (pred_12)

       (pred_5 obj_04)
       (pred_5 obj_13)
       (pred_5 obj_23)
       (pred_5 obj_12)
       (pred_5 obj_27)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_10)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_26)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_31)
       (pred_5 obj_30)
       (pred_5 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_24)
       (pred_11 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_28)
       (pred_9 obj_15)

       (pred_10 obj_04 obj_17)
       (pred_10 obj_04 obj_13)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_13 obj_23)
       (pred_10 obj_13 obj_04)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_23 obj_12)
       (pred_10 obj_23 obj_13)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_12 obj_23)
       (pred_10 obj_27 obj_05)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_03 obj_26)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_20 obj_26)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_26 obj_31)
       (pred_10 obj_26 obj_21)
       (pred_10 obj_26 obj_03)
       (pred_10 obj_26 obj_20)
       (pred_10 obj_21 obj_30)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_26)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_16 obj_31)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_31 obj_25)
       (pred_10 obj_31 obj_30)
       (pred_10 obj_31 obj_26)
       (pred_10 obj_31 obj_16)
       (pred_10 obj_30 obj_29)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_30 obj_21)
       (pred_10 obj_30 obj_31)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_22 obj_25)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_25 obj_29)
       (pred_10 obj_25 obj_31)
       (pred_10 obj_25 obj_22)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_30)
       (pred_10 obj_29 obj_25)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_14)
       (pred_3 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_16)
       (pred_7  obj_18 obj_02)
       (pred_7  obj_10 obj_24)
       (pred_7  obj_16 obj_07)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_2 obj_23)
       (pred_2 obj_12)
       (pred_2 obj_27)
       (pred_2 obj_17)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_05)
       (pred_2 obj_20)
       (pred_2 obj_26)
       (pred_2 obj_21)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_31)
       (pred_2 obj_30)
       (pred_2 obj_09)
       (pred_2 obj_22)
       (pred_2 obj_25)
       (pred_2 obj_29)
       (pred_2 obj_14)
       (pred_2 obj_08)

       (pred_8  obj_11 obj_02)
       (pred_8  obj_28 obj_24)
       (pred_8  obj_15 obj_07)
       (pred_6 obj_11 obj_09)
       (pred_6 obj_28 obj_14)
       (pred_6 obj_15 obj_22)
       (pred_4 obj_08)
    )

    (:goal (and
       (pred_6 obj_11 obj_17)
       (pred_6 obj_15 obj_21)
    ))
(:constraints
  (always (not (pred_4 obj_19)))
)
)

; plan
1. (op_5 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 0 of 2
2. (op_5 obj_14 obj_09)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_09)
   goals met: 0 of 2
3. (op_1 obj_09 obj_11)
   deleted: (pred_6 obj_11 obj_09) (pred_12)
   added: (pred_1 obj_11)
   goals met: 0 of 2
4. (op_5 obj_09 obj_30)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_30)
   goals met: 0 of 2
5. (op_5 obj_30 obj_31)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_31)
   goals met: 0 of 2
6. (op_5 obj_31 obj_25)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_25)
   goals met: 0 of 2
7. (op_5 obj_25 obj_22)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_22)
   goals met: 0 of 2
8. (op_2 obj_22 obj_15 obj_11)
   deleted: (pred_1 obj_11) (pred_6 obj_15 obj_22)
   added: (pred_1 obj_15) (pred_6 obj_11 obj_22)
   goals met: 0 of 2
9. (op_4 obj_22 obj_16 obj_15 obj_07)
   deleted: (pred_3 obj_16)
   added: (pred_2 obj_16)
   goals met: 0 of 2
10. (op_5 obj_22 obj_16)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_16)
   goals met: 0 of 2
11. (op_3 obj_16 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_12) (pred_6 obj_15 obj_16)
   goals met: 0 of 2
12. (op_5 obj_16 obj_22)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_22)
   goals met: 0 of 2
13. (op_1 obj_22 obj_11)
   deleted: (pred_6 obj_11 obj_22) (pred_12)
   added: (pred_1 obj_11)
   goals met: 0 of 2
14. (op_5 obj_22 obj_16)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_16)
   goals met: 0 of 2
15. (op_5 obj_16 obj_20)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_20)
   goals met: 0 of 2
16. (op_5 obj_20 obj_17)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_17)
   goals met: 0 of 2
17. (op_3 obj_17 obj_11)
   deleted: (pred_1 obj_11)
   added: (pred_12) (pred_6 obj_11 obj_17)
   goals met: 1 of 2
18. (op_5 obj_17 obj_20)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_20)
   goals met: 1 of 2
19. (op_5 obj_20 obj_16)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_16)
   goals met: 1 of 2
20. (op_1 obj_16 obj_15)
   deleted: (pred_6 obj_15 obj_16) (pred_12)
   added: (pred_1 obj_15)
   goals met: 1 of 2
21. (op_5 obj_16 obj_20)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_20)
   goals met: 1 of 2
22. (op_5 obj_20 obj_26)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_26)
   goals met: 1 of 2
23. (op_5 obj_26 obj_21)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_21)
   goals met: 1 of 2
24. (op_3 obj_21 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_12) (pred_6 obj_15 obj_21)
   goals met: 2 of 2
